#!/usr/bin/env python3
# --*-- coding: utf-8 --*--

"""
切片

取一个list或tuple的部分元素是非常常见的操作
"""
# 取前N个元素，也就是索引为0-(N-1)的元素，可以用循环
# 对这种经常取指定索引范围的操作，用循环十分繁琐，因此，Python提供了切片（Slice）操作符，能大大简化这种操作

# 取前3个元素，用一行代码就可以完成切片
l = [1, 2, 3, 4, 5]
# [1, 2, 3]
print(l[:3]) # 从索引0开始取，直到索引3为止，但不包括索引3。即索引0，1，2，正好是3个元素, 如果第一个索引是0，可以省略
print(l[0:3])

# 从索引1开始，取出2个元素
print(l[1:3]) # [2, 3]

# 类似的，既然Python支持L[-1]取倒数第一个元素，那么它同样支持倒数切片
print(l[-1:]) # 5  倒数第一个元素的索引是-1
print(l[-3:]) # [3, 4, 5]

# 每两个取一个
print(l[-4::2]) # [2, 4]

# 所有数，每5个取一个
print(l[::5]) # 1

# 甚至什么都不写，只写[:]就可以原样复制一个list
print(l[:])


# tuple也是一种list，唯一区别是tuple不可变。因此，tuple也可以用切片操作，只是操作的结果仍是tuple：
t = (0, 1, 2, 3, 4, 5)[:3]
print(t) # (0, 1, 2)


# 字符串'xxx'也可以看成是一种list，每个元素就是一个字符。因此，字符串也可以用切片操作，只是操作结果仍是字符串：
s = 'ABCDEFG'[:3]
print(s) # 'ABC'

s1 = 'ABCDEFG'[::2]
print(s1) # 'ACEG'

# 在很多编程语言中，针对字符串提供了很多各种截取函数（例如，substring），其实目的就是对字符串切片。
# Python没有针对字符串的截取函数，只需要切片一个操作就可以完成，非常简单。